OC面试整理
一.简历
1.技能要求：
初级工程师： 精通Objective-C语言基础（能够熟练并正确使用oc的分类扩展kvo kvc等）
           精通UIKit等Cocoa Framework（能够正确使用自定义控件）
           熟悉网络通信机制以及常用的数据传输协议
           具备主流开源框架的使用经验
中级工程师： 扎实的编程、数据结构、算法基础
           深入理解语言机制，内存管理、网络、多线程、GUI
           精通常用的设计模式、框架、架构
           良好的分析、解决问题的能力（看源码）
高级工程师： 解决研发过程中的关键问题和技术难题
           调优设备流量、性能、电量、feed流性能优化
           较强的软件设计能力
           对ios内部原理有深刻理解
资深工程师： 精通高性能编程及性能调优（对象创建用多线程解决，字符串遍历选择最优算法）
           灵活运用数据结构、算法解决算法程序设计问题
           提供性能优化、日志搜集、统计分析等方案
           架构、模块设计
2.表达宗旨
简洁性：  排版清晰
         有亮点、优势突出
         2-3页
         挑重要的突出的表达
真实性：  可以包装，但不能伪造
         量化指标说明，比如前后crash量变化，线上bug数，开发成本节约（维护简单，同等条件下，对比安卓，安卓需要2天，我们需要1.5天）

全面性：  邮箱联系方式
        履历公司要全面

3.内容四要素
基本信息：姓名、现居住地、工作年限、学校、学历、专业、邮箱、电话
工作经历：时间 + 任职公司 + 职位（角色变化要有梯度）
        如：2014.07 - 至今      任职公司AAA ios技术负责人
           2011.07 - 2014.07   任职公司BBB ios高级工程师
           2009.07 - 2011.07    任职公司CCC ios初级工程师
项目经验： 列举比较有亮点的2-3个项目
         体现自己承担的角色 （主导-参与-核心研发者）
         项目背景+技术方案+效果
擅长技能





